## [ethanhassett](https://hassettio.app.spacelift.io/stack/ethanhassett/run/01J9J19A8HR1VTJYW8JCS39BXW) plan logs

<details>
<summary>Click here to expand</summary>

```
[01J9HYPD6H9D54GPY6X8AYYPY1] Planning changes with 0 custom hooks...
data.hcp_vault_secrets_secret.google_credentials: Reading...
data.hcp_vault_secrets_secret.cloudflare_api_token: Reading...
data.hcp_vault_secrets_secret.google_credentials: Read complete after 1s [id=spacelift]
data.hcp_vault_secrets_secret.cloudflare_api_token: Read complete after 1s [id=spacelift]
data.cloudflare_zone.this: Reading...
google_service_account.cloud_run: Refreshing state... [id=projects/ethanhassett/serviceAccounts/cloudrun@ethanhassett.iam.gserviceaccount.com]
data.cloudflare_zone.this: Read complete after 1s [id=f96446d78e054da3fe5c6ace7557f782]
cloudflare_record.aaaa["2001:4860:4802:38::15"]: Refreshing state... [id=b9b51c3eec5c1293de742c736c7ef500]
cloudflare_record.a["216.239.34.21"]: Refreshing state... [id=3d4d004aeaae016a183b893188490a37]
cloudflare_record.aaaa["2001:4860:4802:36::15"]: Refreshing state... [id=5cf02e36b18c6242726fd9deb1295f8e]
cloudflare_record.www: Refreshing state... [id=abe64f445c160f7a9ef79eba056048c8]
cloudflare_record.a["216.239.36.21"]: Refreshing state... [id=03b11c6bb0ab016837e8bc94246f4c56]
cloudflare_record.a["216.239.38.21"]: Refreshing state... [id=2a1d5c844e59a05273e7ee6a46e14178]
cloudflare_record.aaaa["2001:4860:4802:34::15"]: Refreshing state... [id=228e4cefd202c650520e3248c66988b6]
cloudflare_record.a["216.239.32.21"]: Refreshing state... [id=9a171cf6f35f813d3b6ca21175a2c23c]
cloudflare_record.aaaa["2001:4860:4802:32::15"]: Refreshing state... [id=75713c511a91630f0e8b0d9f75e9e801]
google_cloud_run_v2_service.this: Refreshing state... [id=projects/ethanhassett/locations/us-east1/services/ethanhassett]
google_project_iam_binding.service_account_user: Refreshing state... [id=ethanhassett/roles/iam.serviceAccountUser]
google_project_iam_binding.cloud_run_admin: Refreshing state... [id=ethanhassett/roles/run.admin]
google_cloud_run_domain_mapping.this: Refreshing state... [id=locations/us-east1/namespaces/ethanhassett/domainmappings/ethanhassett.com]
google_cloud_run_domain_mapping.www: Refreshing state... [id=locations/us-east1/namespaces/ethanhassett/domainmappings/www.ethanhassett.com]
google_cloud_run_service_iam_binding.this: Refreshing state... [id=v1/projects/ethanhassett/locations/us-east1/services/ethanhassett/roles/run.invoker]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # google_artifact_registry_repository.this will be created
  + resource "google_artifact_registry_repository" "this" {
      + create_time      = (known after apply)
      + description      = "Docker repository for ethanhassett.com"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
          + "repo"                       = "ethanhassett"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = (known after apply)
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "ethanhassett"
      + repository_id    = "ethanhassett"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
          + "repo"                       = "ethanhassett"
        }
      + update_time      = (known after apply)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_cloud_run_v2_service.this will be updated in-place
  ~ resource "google_cloud_run_v2_service" "this" {
        id                      = "projects/ethanhassett/locations/us-east1/services/ethanhassett"
        name                    = "ethanhassett"
        # (27 unchanged attributes hidden)

      ~ template {
            # (7 unchanged attributes hidden)

          ~ containers {
              ~ image      = "docker.io/hassett/ethanhassett:0.0.2" -> "us-east1-docker.pkg.dev/ethanhassett/ethanhassett/ethanhassett:0.0.3"
                # (3 unchanged attributes hidden)

                # (3 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

[01J9HYPD6H9D54GPY6X8AYYPY1] Changes are GO
[01J9HYPD6H9D54GPY6X8AYYPY1] Uploading the list of managed resources...
[01J9HYPD6H9D54GPY6X8AYYPY1] Generating Infracost JSON report from plan
2024-10-06T23:06:09Z WARN 2 "google_cloud_run_v2_service" prices missing across 1 resource


[01J9HYPD6H9D54GPY6X8AYYPY1] Infracost report generated successfully
[01J9HYPD6H9D54GPY6X8AYYPY1] Mapping Infracost data to resources
[01J9HYPD6H9D54GPY6X8AYYPY1] Costs mapped successfully
[01J9HYPD6H9D54GPY6X8AYYPY1] Please be aware that the run changes calculation includes output changes.
[01J9HYPD6H9D54GPY6X8AYYPY1] Resource list upload is GO
[01J9HYPD6H9D54GPY6X8AYYPY1] Generating JSON representation of the plan...
[01J9HYPD6H9D54GPY6X8AYYPY1] JSON representation is GO
[01J9HYPD6H9D54GPY6X8AYYPY1] Generating Infracost JSON report from plan
2024-10-06T23:06:15Z WARN 2 "google_cloud_run_v2_service" prices missing across 1 resource


[01J9HYPD6H9D54GPY6X8AYYPY1] Infracost report generated successfully
[01J9HYPD6H9D54GPY6X8AYYPY1] Loading custom plan policy inputs...
[01J9HYPD6H9D54GPY6X8AYYPY1] 0 custom plan policy inputs found
[01J9HYPD6H9D54GPY6X8AYYPY1] No plan policies to evaluate
```

</details>